import  React from "react";
import './index.scss';

const questions = [
  {
    title: 'Що таке потенційний конфлікт інтересів ?',
    variants: [
      'жопа',
      'галик',
      'наявність у особи приватного інтересу у сфері, в якій вона виконує свої службові чи представницькі повноваження, що може вплинути на об’єктивність чи неупередженість прийняття нею рішень, або на вчинення чи невчинення дій під час виконання зазначених повноважень'],
    correct: 2,
  },
  {
    title: 'Корупційне правопорушення - це ... ',
    variants: [
      'діяння, що містить ознаки корупції за за яке законом встановлено кримінальну, дисциплінарну та/або цивільно-правову відповідальність',
      'діяння, що містить ознаки корупції за яке законом встановлено кримінальну, адміністративну, дисциплінарну та/або цивільно-правову відповідальність',
      'діяння, що містить ознаки корупції за за яке законом "Про запобігання корупції" встановлено кримінальну відповідальність'],
    correct: 0,
  },
  {
    title: 'Подарунок - це...',
    variants: [
      '',
      'грошові кошти або інше майно, переваги, пільги, послуги, нематеріальні активи, які надають/одержують безоплатно або за ціною, нижчою мінімальної ринкової',
      ''],
    correct: 1,
  },
  {
    title: 'Неправомірна вигода - це...',
    variants: [
      'грошові кошти або інше майно, переваги, пільги, послуги, нематеріальні активи, будь-які інші вигоди нематеріального чи негрошового характеру, які обіцяють, пропонують, надають або одержують без законних на те підстав',
      '',
      ''],
    correct: 0,
  },
  {
    title: 'Правопорушення, пов’язане з корупцією - це...',
    variants: [
      ' діяння, що не містить ознак корупції, але порушує встановлені цим Законом вимоги, заборони та обмеження, вчинене особою, зазначеною у частині першій статті 3 цього Закону, за яке законом встановлено кримінальну, адміністративну, дисциплінарну та/або цивільно-правову відповідальність;',
      '',
      ''],
    correct: 0,
  },
  {
    title: 'Реальний конфлікт інтересів - це...?',
    variants: [
      '',
      '',
      'суперечність між приватним інтересом особи та її службовими чи представницькими повноваженнями, що впливає на об’єктивність або неупередженість прийняття рішень, або на вчинення чи невчинення дій під час виконання зазначених повноважень'
    ],
    correct: 2,
  },
  {
    title: 'Спеціально уповноважені суб’єкти у сфері протидії корупції - це...',
    variants: [
      'органи прокуратури, Національної поліції, Національне антикорупційне бюро України, Національне агентство з питань запобігання корупції, Державне бюро розслідувань',
      'органи прокуратури, Національної поліції, Національне антикорупційне бюро України, Національне агентство з питань запобігання корупції, Служба безпеки України',
      'органи прокуратури, Національної поліції, Національне антикорупційне бюро України, Національне агентство з питань запобігання корупції'],
    correct: 2,
  },
  {
    title: 'це...',
    variants: [
      'Это простой HTML',
      '',
      '',
    ],
    correct: 0,
  },
  {
    title: 'це...',
    variants: [
      '',
      '',
      'Это тот же HTML, но с возможностью выполнять JS-код',
    ],
    correct: 2,
  },
  {
    title: 'це...',
    variants: [
      'Это простой HTML',
      '',
      '',
    ],
    correct: 0,
  },
  {
    title: 'це...',
    variants: [
      '',
      'Это функция',
      '',
    ],
    correct: 1,
  },
  {
    title: 'це...',
    variants: [
      '',
      'Это функция',
      '',
    ],
    correct: 1,
  },
  {
    title: 'це...',
    variants: [
      '',
      '',
      'Это тот же HTML, но с возможностью выполнять JS-код',
    ],
    correct: 2,
  },
  {
    title: 'це...',
    variants: [
      '',
      'Это функция',
      '',
    ],
    correct: 1,
  },
  {
    title: 'це...',
    variants: [
      'Это простой HTML',
      '',
      '',
    ],
    correct: 0,
  },
  
  
];

function Result({correct }) {
  return (
   <div className="result">
      {/*<img src="https://cdn-icons-png.flaticon.com/512/2278/2278992.png" />*/}
      <h2>Ви відповіли вірно на {correct} питань з {questions.length }</h2>
      <a href="/">
      <button>Тестування закінчено</button>
      </a>
      
    </div>
  );
}

function Game( { step, question, onClickVariant  }) {
  const percentage = Math.round((step / questions.length) * 100);
  console.log(percentage);
  return (
    <>
      <div className="progress">
        <div style={{ width: `${percentage}%` }} className="progress__inner"></div>
      </div>
      <h1>{question.title}</h1>
      <ul>
        
        {
          question.variants.map((text, index) =>
            <li onClick={()=>onClickVariant(index)} >{text}</li>)
        }
      </ul>
    </>
  );
}

function App() {
  const [step, setStep] = React.useState(0);
  const [correct, setCorrect] = React.useState(0);
  const question = questions[step];

  const onClickVariant = (index) => {
    setStep(step + 1);

    if (index === question.correct) {
      setCorrect(correct + 1);
    }
  };

  return (
    <div className="App">
      {
        step !== questions.length ? (<Game  step={step} question={question}
          onClickVariant={onClickVariant} />
        ) : (
            <Result correct={correct } /> 
      )}
     
      {/* <Result /> */}
    </div>
  );
}

export default App;
