import  React from "react";
import './index.scss';

const questions = [
  {
    title: 'Що таке потенційний конфлікт інтересів ?',
    variants: [
      'наявність у особи інтересу осбистого характеру у сфері, в якій вона виконує свої службові повноваження, що може вплинути на об’єктивність чи неупередженість прийняття нею рішень, або на вчинення чи невчинення дій під час виконання зазначених повноважень',
      'наявність у особи постійного особистого інтересу у сфері, в якій вона виконує свої службові чи представницькі функції, що може вплинути на об’єктивність чи неупередженість прийняття нею рішень, або на вчинення чи невчинення дій під час виконання зазначених повноважень',
      'наявність у особи приватного інтересу у сфері, в якій вона виконує свої службові чи представницькі повноваження, що може вплинути на об’єктивність чи неупередженість прийняття нею рішень, або на вчинення чи невчинення дій під час виконання зазначених повноважень'],
    correct: 2,
  },
  {
    title: 'Корупційне правопорушення - це ... ',
    variants: [
      'діяння, що містить ознаки корупції за за яке законом встановлено кримінальну, дисциплінарну та/або цивільно-правову відповідальність',
      'діяння, що містить ознаки корупції за яке законом встановлено кримінальну, адміністративну, дисциплінарну та/або цивільно-правову відповідальність',
      'діяння, що містить ознаки корупції за за яке законом "Про запобігання корупції" встановлено кримінальну відповідальність'],
    correct: 0,
  },
  {
    title: 'Подарунок - це...',
    variants: [
      'неправомірна вигода у вигляді грошових коштів, переваг, пільг, послуг, нематеріальних активів, які надають/одержують безоплатно або за ціною, нижчою мінімальної ринкової',
      'грошові кошти або інше майно, переваги, пільги, послуги, нематеріальні активи, які надають/одержують безоплатно або за ціною, нижчою мінімальної ринкової',
      'грошові кошти, переваги, пільги, послуги, нематеріальні активи, які надають/одержують безоплатно або за ціною, нижчою мінімальної ринкової'],
    correct: 1,
  },
  {
    title: 'Неправомірна вигода - це...',
    variants: [
      'грошові кошти або інше майно, переваги, пільги, послуги, нематеріальні активи, будь-які інші вигоди нематеріального чи негрошового характеру, які обіцяють, пропонують, надають або одержують без законних на те підстав',
      'грошові кошти або інше майно, переваги, пільги, послуги, нематеріальні активи, які надають/одержують безоплатно або за ціною, нижчою мінімальної ринкової',
      'грошові кошти, переваги, пільги, послуги, нематеріальні активи, які надають/одержують безоплатно або за ціною, нижчою мінімальної ринкової'],
    correct: 0,
  },
  {
    title: 'Правопорушення, пов’язане з корупцією - це...',
    variants: [
      ' діяння, що не містить ознак корупції, але порушує встановлені вимоги, заборони та обмеження, за яке законом встановлено кримінальну, адміністративну, дисциплінарну та/або цивільно-правову відповідальність',
      'діяння, що не містить ознак корупції, але порушує встановлені вимоги, заборони та обмеження, за яке законом встановлено кримінальну, адміністративну, цивільну, дисциплінарну та/або цивільно-правову відповідальність',
      'діяння, що містить ознаки корупції та порушує встановлені вимоги, заборони та обмеження, за яке законом встановлено кримінальну, адміністративну, дисциплінарну та/або цивільно-правову відповідальність;'],
    correct: 0,
  },
  {
    title: 'Реальний конфлікт інтересів - це...?',
    variants: [
      'наявність у особи інтересу осбистого характеру у сфері, в якій вона виконує свої службові повноваження, що може вплинути на об’єктивність чи неупередженість прийняття нею рішень, або на вчинення чи невчинення дій під час виконання зазначених повноважень',
      'наявність у особи суперечності осбистого характеру у сфері, в якій вона виконує свої службові повноваження, що може вплинути на об’єктивність чи неупередженість прийняття нею рішень, або на вчинення чи невчинення дій під час виконання зазначених повноважень',
      'суперечність між приватним інтересом особи та її службовими чи представницькими повноваженнями, що впливає на об’єктивність або неупередженість прийняття рішень, або на вчинення чи невчинення дій під час виконання зазначених повноважень'
    ],
    correct: 2,
  },
  {
    title: 'Спеціально уповноважені суб’єкти у сфері протидії корупції - це...',
    variants: [
      'органи прокуратури, Національної поліції, Національне антикорупційне бюро України, Національне агентство з питань запобігання корупції, Державне бюро розслідувань',
      'органи прокуратури, Національної поліції, Національне антикорупційне бюро України, Національне агентство з питань запобігання корупції, Служба безпеки України',
      'органи прокуратури, Національної поліції, Національне антикорупційне бюро України, Національне агентство з питань запобігання корупції'],
    correct: 2,
  },
  {
    title: 'Викривач - це...',
    variants: [
      'фізична особа, яка за наявності переконання, що інформація є достовірною, повідомила про можливі факти корупційних або пов’язаних з корупцією правопорушень, інших порушень Закону "Про запобігння корупції, вчинених іншою особою, якщо така інформація стала їй відома у зв’язку з її трудовою, професійною, господарською, громадською, науковою діяльністю, проходженням нею служби чи навчання або її участю у передбачених законодавством процедурах, які є обов’язковими для початку такої діяльності, проходження служби чи навчання',
      'фізична або юридична особа, яка за наявності переконання, що інформація є достовірною, повідомила про можливі факти корупційних або пов’язаних з корупцією правопорушень, інших порушень Закону "Про запобігння корупції", вчинених іншою особою, якщо така інформація стала їй відома у зв’язку з її трудовою, професійною, господарською, громадською, науковою діяльністю, проходженням нею служби чи навчання або її участю у передбачених законодавством процедурах, які є обов’язковими для початку такої діяльності, проходження служби чи навчання;',
      'громадянин України,особа без громадянства,предствник іноземної держави який за наявності переконання, що інформація є достовірною, повідомила про можливі факти корупційних або пов’язаних з корупцією правопорушень, інших порушень Закону "Про запобігння корупції, вчинених іншою особою, якщо така інформація стала їй відома у зв’язку з її трудовою, професійною, господарською, громадською, науковою діяльністю, проходженням нею служби чи навчання або її участю у передбачених законодавством процедурах, які є обов’язковими для початку такої діяльності, проходження служби чи навчання',
    ],
    correct: 0,
  },
  {
    title: 'Регулярні канали повідомлення - це...',
    variants: [
      'способи захищеного (у тому числі анонімного) повідомлення інформації викривачем керівнику або уповноваженому підрозділу (особі) органу, юридичної особи, у яких викривач працює, проходить службу чи навчання',
      'шляхи повідомлення інформації викривачем через фізичних чи юридичних осіб, у тому числі через засоби масової інформації, журналістів, громадські об’єднання, професійні спілки тощо',
      'способи захищеного (у тому числі анонімного) повідомлення інформації викривачем органам прокуратури, Національній поліції, Національному антикорупційному бюро України, Державному бюро розслідувань, Національному агентству з питань запобігання корупції',
    ],
    correct: 2,
  },
  {
    title: 'Зовнішні канали повідомлення - це...',
    variants: [
      'шляхи повідомлення інформації викривачем через фізичних чи юридичних осіб, у тому числі через засоби масової інформації, журналістів, громадські об’єднання, професійні спілки тощо',
      'способи захищеного (у тому числі анонімного) повідомлення інформації викривачем органам прокуратури, Національній поліції, Національному антикорупційному бюро України, Державному бюро розслідувань, Національному агентству з питань запобігання корупції',
      'способи захищеного (у тому числі анонімного) повідомлення інформації викривачем керівнику або уповноваженому підрозділу (особі) органу, юридичної особи, у яких викривач працює, проходить службу чи навчання',
    ],
    correct: 0,
  },
  {
    title: 'Внутрішні канали повідомлення - це...',
    variants: [
      'шляхи повідомлення інформації викривачем через фізичних чи юридичних осіб, у тому числі через засоби масової інформації, журналістів, громадські об’єднання, професійні спілки тощо',
      'способи захищеного (у тому числі анонімного) повідомлення інформації викривачем керівнику або уповноваженому підрозділу (особі) органу, юридичної особи, у яких викривач працює, проходить службу чи навчання',
      'способи захищеного (у тому числі анонімного) повідомлення інформації викривачем органам прокуратури, Національній поліції, Національному антикорупційному бюро України, Державному бюро розслідувань, Національному агентству з питань запобігання корупції',
    ],
    correct: 1,
  },
  {
    title: 'це...',
    variants: [
      '',
      'Это функция',
      '',
    ],
    correct: 1,
  },
  {
    title: 'це...',
    variants: [
      '',
      '',
      'Это тот же HTML, но с возможностью выполнять JS-код',
    ],
    correct: 2,
  },
  {
    title: 'це...',
    variants: [
      '',
      'Это функция',
      '',
    ],
    correct: 1,
  },
  {
    title: 'Приватний інтерес - це...',
    variants: [
      'будь-який майновий чи немайновий інтерес особи, у тому числі зумовлений особистими, сімейними, дружніми чи іншими позаслужбовими стосунками з фізичними чи юридичними особами, у тому числі ті, що виникають у зв’язку з членством або діяльністю в громадських, політичних, релігійних чи інших організаціях',
      'будь-який майновий чи немайновий потенційний інтерес особи, у тому числі зумовлений особистими, сімейними, дружніми чи іншими позаслужбовими стосунками з фізичними чи юридичними особами, у тому числі ті, що виникають у зв’язку з членством або діяльністю в громадських, політичних, релігійних чи інших організаціях',
      'будь-який фінансовий, майновий чи немайновий інтерес особи, у тому числі зумовлений особистими, сімейними, дружніми чи іншими позаслужбовими стосунками з фізичними чи юридичними особами, у тому числі ті, що виникають у зв’язку з членством або діяльністю в громадських, політичних, релігійних чи інших організаціях',
    ],
    correct: 0,
  },
  
  
];

function Result({correct }) {
  return (
   <div className="result">
      {/*<img src="https://cdn-icons-png.flaticon.com/512/2278/2278992.png" />*/}
      <h2>Ви відповіли вірно на {correct} питань з {questions.length }</h2>
      <a href="/">
      <button>Тестування закінчено</button>
      </a>
      
    </div>
  );
}

function Game( { step, question, onClickVariant  }) {
  const percentage = Math.round((step / questions.length) * 100);
  console.log(percentage);
  return (
    <>
      <div className="progress">
        <div style={{ width: `${percentage}%` }} className="progress__inner"></div>
      </div>
      <h1>{question.title}</h1>
      <ul>
        
        {
          question.variants.map((text, index) =>
            <li onClick={()=>onClickVariant(index)} >{text}</li>)
        }
      </ul>
    </>
  );
}

function App() {
  const [step, setStep] = React.useState(0);
  const [correct, setCorrect] = React.useState(0);
  const question = questions[step];

  const onClickVariant = (index) => {
    setStep(step + 1);

    if (index === question.correct) {
      setCorrect(correct + 1);
    }
  };

  return (
    <div className="App">
      {
        step !== questions.length ? (<Game  step={step} question={question}
          onClickVariant={onClickVariant} />
        ) : (
            <Result correct={correct } /> 
      )}
     
      {/* <Result /> */}
    </div>
  );
}

export default App;
